#+TITLE: Plan for Outreach Portal
#+AUTHOR: VLEAD
#+DATE: [2018-05-18 Fri]
#+PROPERTY: results output
#+PROPERTY: exports code
#+SETUPFILE: ../org-templates/level-1.org
#+options: ^:nil
#+LATEX: Literal LaTeX code for export

* Introduction
  - This document contains the realization plan for
    implementing the Outreach portal driven by data.

* Milestones Snapshot
  |------+-------+---------+------------------------------+------+------------+---------+---------+--------|
  | S.No | Mi.no | Req Map | Milestone                    | Plan | Status     | Est hrs | Act hrs | Issues |
  |------+-------+---------+------------------------------+------+------------+---------+---------+--------|
  |   1. |       |         | [[https://github.com/vlead/outreach-portal/issues?q=is%3Aopen+is%3Aissue+milestone%3A%22Outreach+Portal+Enhancements%22][Outreach Portal Enhancements]] |      | Inprogress |     312 |         |      8 |
  |------+-------+---------+------------------------------+------+------------+---------+---------+--------|
  |   2. |       |         | [[https://gitlab.com/vlead-systems/vlead-security-audit/milestones/9][C-DAC Phase II]]               |      | Done       |     240 |      32 |      5 |
  |------+-------+---------+------------------------------+------+------------+---------+---------+--------|

  #+TBLFM: $est=vsum(@II+1..@-1)
  #+TBLFM: $act=vsum(@II+1..@-1)

* Detailed Plan 
** Outreach Portal Enhancements
#+caption:  realization-plan-milestone-1
#+name: tbl-rlz-pln-ml-1

|-------+-----------------------------------------------------------------------------------+---------------+----------------------------------+--------------------------------+----------------------------+-------------------------+---------+-----------|
|  S.No | Tasks                                                                             | Github Issues | Expected Effort(in person hours) | Actual Effort(in person hours) | Estimated Start, End Dates | Actual Start, End Dates | Status  | Assignee  |
|-------+-----------------------------------------------------------------------------------+---------------+----------------------------------+--------------------------------+----------------------------+-------------------------+---------+-----------|
|    1. | Update footer in portal                                                           | [[https://github.com/vlead/outreach-portal/issues/260][#260]]          |                               16 |                                |                            |                         | Backlog | Mrudhvika |
|-------+-----------------------------------------------------------------------------------+---------------+----------------------------------+--------------------------------+----------------------------+-------------------------+---------+-----------|
|    2. | Adding contact details of the nodal coordinator                                   | [[https://github.com/vlead/outreach-portal/issues/265][#265]]          |                               64 |                             56 |                 23-05-2018 |              23-05-2018 | Done    | Sadhana   |
|-------+-----------------------------------------------------------------------------------+---------------+----------------------------------+--------------------------------+----------------------------+-------------------------+---------+-----------|
|    3. | New requirement : Sorting feature in workshop history details                     | [[https://github.com/vlead/outreach-portal/issues/266][#266]]          |                               48 |                                |                 10-07-2018 |                         | Backlog | Sadhana   |
|-------+-----------------------------------------------------------------------------------+---------------+----------------------------------+--------------------------------+----------------------------+-------------------------+---------+-----------|
|    4. | Tool tips on Create workshop fields (For e.g. on Gateway Ip of college            | [[https://github.com/vlead/outreach-portal/issues/274][#274]]          |                               24 |                                |                            |                         | Backlog | Mrudhvika |
|-------+-----------------------------------------------------------------------------------+---------------+----------------------------------+--------------------------------+----------------------------+-------------------------+---------+-----------|
|    5. | Grid View for exporting the workshop, Nodal centers and usage data                | [[https://github.com/vlead/outreach-portal/issues/275][#275]]          |                               48 |                                |                 18-07-2018 |                         | Backlog | Sadhana   |
|-------+-----------------------------------------------------------------------------------+---------------+----------------------------------+--------------------------------+----------------------------+-------------------------+---------+-----------|
|    6. | Segregation of Online and Offline workshops conducted                             | [[https://github.com/vlead/outreach-portal/issues/276][#276]]          |                               32 |                                |                 04-07-2018 |                         | Backlog | Sadhana   |
|-------+-----------------------------------------------------------------------------------+---------------+----------------------------------+--------------------------------+----------------------------+-------------------------+---------+-----------|
|    7. | Fix loading time of data in portal main page                                      | [[https://github.com/vlead/outreach-portal/issues/294][#294]]          |                               64 |                                |                            |                         | Backlog | Mrudhvika |
|-------+-----------------------------------------------------------------------------------+---------------+----------------------------------+--------------------------------+----------------------------+-------------------------+---------+-----------|
|    8. | Identify and remove all the broken links in portal                                | [[https://github.com/vlead/outreach-portal/issues/295][#295]]          |                               16 |                                |                            |                         | Backlog | Mrudhvika |
|-------+-----------------------------------------------------------------------------------+---------------+----------------------------------+--------------------------------+----------------------------+-------------------------+---------+-----------|
| Total |                                                                                   |               |                          312 est |                                |                            |                         |         |           |
|-------+-----------------------------------------------------------------------------------+---------------+----------------------------------+--------------------------------+----------------------------+-------------------------+---------+-----------|

** C-DAC Phase II
#+caption:  realization-plan-milestone-1
#+name: tbl-rlz-pln-ml-1

|-------+--------------------------------------------------+---------------+----------------------------------+--------------------------------+----------------------------+-------------------------+------------+----------|
|  S.No | Tasks                                            | Github Issues | Expected Effort(in person hours) | Actual Effort(in person hours) | Estimated Start, End Dates | Actual Start, End Dates | Status     | Assignee |
|-------+--------------------------------------------------+---------------+----------------------------------+--------------------------------+----------------------------+-------------------------+------------+----------|
|    1. | outreach-portal Sensitive Information Disclosure | [[https://gitlab.com/vlead-systems/vlead-security-audit/issues/593][#593]]          |                               48 |                              8 |                 21-05-2018 |              21-05-2018 | Done       | Sadhana  |
|-------+--------------------------------------------------+---------------+----------------------------------+--------------------------------+----------------------------+-------------------------+------------+----------|
|    2. | outreach-portal "Error Based SQL Injection"      | [[https://gitlab.com/vlead-systems/vlead-security-audit/issues/592][#592]]          |                               48 |                              8 |                 28-05-2018 |              22-05-2018 | Done       | Sadhana  |
|-------+--------------------------------------------------+---------------+----------------------------------+--------------------------------+----------------------------+-------------------------+------------+----------|
|    3. | outreach-portal Authorization Bypass             | [[https://gitlab.com/vlead-systems/vlead-security-audit/issues/591][#591]]          |                               48 |                                |                            |                         | Inprogress |          |
|-------+--------------------------------------------------+---------------+----------------------------------+--------------------------------+----------------------------+-------------------------+------------+----------|
|    4. | outreach-portal Python Version Disclosure        | [[https://gitlab.com/vlead-systems/vlead-security-audit/issues/590][#590]]          |                               48 |                              8 |                 29-05-2018 |              22-05-2018 | Done       | Sadhana  |
|-------+--------------------------------------------------+---------------+----------------------------------+--------------------------------+----------------------------+-------------------------+------------+----------|
|    5. | outreach-portal Cross-Site Tracing               | [[https://gitlab.com/vlead-systems/vlead-security-audit/issues/589][#589]]          |                               48 |                              8 |                 07-06-2018 |              22-05-2018 | Done       | Sadhana  |
|-------+--------------------------------------------------+---------------+----------------------------------+--------------------------------+----------------------------+-------------------------+------------+----------|
| Total |                                                  |               |                          240 est |                        32  act |                            |                         |            |          |
|-------+--------------------------------------------------+---------------+----------------------------------+--------------------------------+----------------------------+-------------------------+------------+----------|
#+TBLFM: $est=vsum(@II+1..@-1)
#+TBLFM: $act=vsum(@II+1..@-1)
